wellrun/hc32f460/hc32f460_sdk/驱动库及样例/hc32f46x_ddl_v1.0.3/example/adc/adc_05_sa_sb_interrupt/source/main.c
    /* Config ADC1 sequence B interrupt */
    stcAdcIrqCfg.enIntSrc    = INT_ADC1_EOCB;
    stcAdcIrqCfg.enIRQn      = Int116_IRQn;
    stcAdcIrqCfg.pfnCallback = ADC1B_IrqHandler;
    AdcIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_04);

    /* Config ADC2 sequence A interrupt */
    stcAdcIrqCfg.enIntSrc    = INT_ADC2_EOCA;
    stcAdcIrqCfg.enIRQn      = Int120_IRQn;
    stcAdcIrqCfg.pfnCallback = ADC2A_IrqHandler;
    AdcIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_06);

    /* Config ADC2 sequence B interrupt */
    stcAdcIrqCfg.enIntSrc    = INT_ADC2_EOCB;
    stcAdcIrqCfg.enIRQn      = Int142_IRQn;
    AdcIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_05);
}

static void AdcIrqRegister(stc_irq_regi_conf_t *pstcCfg, uint32_t u32Priority)
{
    int16_t s16Vnum = pstcCfg->enIRQn;

    if (((s16Vnum >= Int000_IRQn) && (s16Vnum <= Int031_IRQn)) ||
        ((s16Vnum >= Int116_IRQn) && (s16Vnum <= Int120_IRQn)))
    {
        if (Ok != enIrqRegistration(pstcCfg))
        {
            return;
        }
    }
    else if (Int142_IRQn == s16Vnum)
    {
        enShareIrqEnable(pstcCfg->enIntSrc);
    }
    else
    {
        return;
    }
    NVIC_ClearPendingIRQ(pstcCfg->enIRQn);
    NVIC_SetPriority(pstcCfg->enIRQn, u32Priority);
    NVIC_EnableIRQ(pstcCfg->enIRQn);
}

/**
 *******************************************************************************
 ** \brief  Timer configuration, for generating event EVT_TMR02_GCMA every second.
 **
 ** \param  None.
 **
 ** \retval None.
 **
 ******************************************************************************/
static void TimerConfig(void)
{
    stc_tim0_base_init_t stcTimerCfg;
    stc_clk_freq_t stcClkTmp;
    uint32_t u32Pclk1;

    MEM_ZERO_STRUCT(stcTimerCfg);
    /* Get PCLK1. */
    CLK_GetClockFreq(&stcClkTmp);
    u32Pclk1 = stcClkTmp.pclk1Freq;

    /* Timer0 peripheral enable. */
    ENABLE_TMR0();
    /* Config register for channel A. */
    stcTimerCfg.Tim0_CounterMode = Tim0_Sync;
    stcTimerCfg.Tim0_SyncClockSource = Tim0_Pclk1;
    stcTimerCfg.Tim0_ClockDivision = Tim0_ClkDiv1024;
    /* Tim0_CmpValue's type is uint16_t!!! Be careful!!! */
    stcTimerCfg.Tim0_CmpValue = u32Pclk1 / 1024 - 1;
    TIMER0_BaseInit(TMR_UNIT, Tim0_ChannelA, &stcTimerCfg);

    /* Start timer0. */
    TIMER0_Cmd(TMR_UNIT, Tim0_ChannelA, Enable);
}

/**
 *******************************************************************************
 ** \brief IRQ callbacks.
 **
 ******************************************************************************/
void ADC1A_IrqHandler(void)
{
    if (Set == ADC_GetConvFlag(M4_ADC1, AdcSequence_A))
    {
        ADC_GetData(M4_ADC1, m_au16Adc1Value);
        ADC_ClrConvFlag(M4_ADC1, AdcSequence_A);
        m_u32AdcIrqFlag |= ADC1_SA_IRQ_BIT;
    }
}

void ADC1B_IrqHandler(void)
{
    if (Set == ADC_GetConvFlag(M4_ADC1, AdcSequence_B))
    {
        ADC_GetData(M4_ADC1, m_au16Adc1Value);
        ADC_ClrConvFlag(M4_ADC1, AdcSequence_B);
        m_u32AdcIrqFlag |= ADC1_SB_IRQ_BIT;
    }
}

void ADC2A_IrqHandler(void)
{
    if (Set == ADC_GetConvFlag(M4_ADC2, AdcSequence_A))
    {
        ADC_GetData(M4_ADC2, m_au16Adc2Value);
        ADC_ClrConvFlag(M4_ADC2, AdcSequence_A);
        m_u32AdcIrqFlag |= ADC2_SA_IRQ_BIT;
    }
}

void ADC2B_IrqHandler(void)
{
    if (Set == ADC_GetConvFlag(M4_ADC2, AdcSequence_B))
    {
        ADC_GetData(M4_ADC2, m_au16Adc2Value);
        ADC_ClrConvFlag(M4_ADC2, AdcSequence_B);
        m_u32AdcIrqFlag |= ADC2_SB_IRQ_BIT;
    }
}

/**
 *******************************************************************************
 ** \brief  Config the pin which is mapping the channel to analog or digit mode.
 **
 ******************************************************************************/
static void AdcSetChannelPinMode(M4_ADC_TypeDef *ADCx,
                                 uint32_t u32Channel,
                                 en_pin_mode_t enMode)
{
    uint8_t u8ChIndex;
#if (ADC_CH_REMAP)
    uint8_t u8AdcPin;
#else
    uint8_t u8ChOffset = 0u;
#endif

    if ((NULL == ADCx) || (0u == u32Channel))
    {
        return;
    }

    if (M4_ADC1 == ADCx)
    {
        u32Channel &= ADC1_PIN_MASK_ALL;
    }
    else
    {
        u32Channel &= ADC2_PIN_MASK_ALL;
#if (!ADC_CH_REMAP)
        u8ChOffset = 4u;
#endif
    }

    u8ChIndex = 0u;
    while (0u != u32Channel)
    {
        if (u32Channel & 0x1ul)
        {
#if (ADC_CH_REMAP)
            u8AdcPin = ADC_GetChannelPinNum(ADCx, u8ChIndex);
            AdcSetPinMode(u8AdcPin, enMode);
#else
            AdcSetPinMode((u8ChIndex + u8ChOffset), enMode);
#endif
        }

        u32Channel >>= 1u;
        u8ChIndex++;
    }
}

/**
 *******************************************************************************
 ** \brief  Set an ADC pin as analog input mode or digit mode.
 **
 ******************************************************************************/
static void AdcSetPinMode(uint8_t u8AdcPin, en_pin_mode_t enMode)
{
    en_port_t enPort;
    en_pin_t enPin;
    stc_port_init_t stcPortInit;

    MEM_ZERO_STRUCT(stcPortInit);
    stcPortInit.enPinMode = enMode;
    stcPortInit.enPullUp = Disable;

    switch (u8AdcPin)
    {
    case ADC1_IN0:
        enPort = PortA;
        enPin  = Pin00;
        break;

    case ADC1_IN1:
        enPort = PortA;
        enPin  = Pin01;
        break;

    case ADC1_IN2:
        enPort = PortA;
        enPin  = Pin02;
        break;

    case ADC1_IN3:
        enPort = PortA;
        enPin  = Pin03;
        break;

    case ADC12_IN4:
        enPort = PortA;
        enPin  = Pin04;
        break;

    case ADC12_IN5:
        enPort = PortA;
        enPin  = Pin05;
        break;

    case ADC12_IN6:
        enPort = PortA;
        enPin  = Pin06;
        break;

    case ADC12_IN7:
        enPort = PortA;
        enPin  = Pin07;
        break;

    case ADC12_IN8:
        enPort = PortB;
        enPin  = Pin00;
        break;

    case ADC12_IN9:
        enPort = PortB;
        enPin  = Pin01;
        break;

    case ADC12_IN10:
        enPort = PortC;
        enPin  = Pin00;
        break;

    case ADC12_IN11:
        enPort = PortC;
        enPin  = Pin01;
        break;

    case ADC1_IN12:
        enPort = PortC;
        enPin  = Pin02;
        break;

    case ADC1_IN13:
        enPort = PortC;
        enPin  = Pin03;
        break;

    case ADC1_IN14:
        enPort = PortC;
        enPin  = Pin04;
        break;

    case ADC1_IN15:
        enPort = PortC;
        enPin  = Pin05;
        break;

    default:
        return;
    }

    PORT_Init(enPort, enPin, &stcPortInit);
}

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
